#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # panos_antivirus_security_profile.example will be created
  + resource "panos_antivirus_security_profile" "example" {
      + description  = "example AV profile"
      + device_group = "production"
      + id           = (known after apply)
      + name         = "av"
      + vsys         = "vsys1"

      + application_exception {
          + action      = "alert"
          + application = "hotmail"
        }

      + decoder {
          + action          = "default"
          + name            = "smtp"
          + wildfire_action = "default"
        }
      + decoder {
          + action          = "default"
          + name            = "smb"
          + wildfire_action = "default"
        }
      + decoder {
          + action          = "default"
          + name            = "pop3"
          + wildfire_action = "default"
        }
      + decoder {
          + action          = "default"
          + name            = "imap"
          + wildfire_action = "default"
        }
      + decoder {
          + action          = "default"
          + name            = "http"
          + wildfire_action = "default"
        }
      + decoder {
          + action          = "default"
          + name            = "http2"
          + wildfire_action = "default"
        }
      + decoder {
          + action          = "reset-both"
          + name            = "ftp"
          + wildfire_action = "default"
        }
    }

  # panos_panorama_device_group.this will be created
  + resource "panos_panorama_device_group" "this" {
      + description = "example device group for policy as code demo"
      + id          = (known after apply)
      + name        = "production"
    }

  # panos_panorama_security_rule_group.this will be created
  + resource "panos_panorama_security_rule_group" "this" {
      + device_group = "production"
      + id           = (known after apply)
      + rulebase     = "pre-rulebase"
      + vsys         = "vsys1"

      + rule {
          + action                = "allow"
          + applications          = [
              + "dns",
            ]
          + categories            = [
              + "any",
            ]
          + destination_addresses = [
              + "8.8.8.4",
            ]
          + destination_zones     = [
              + "dmz",
            ]
          + hip_profiles          = [
              + "any",
            ]
          + log_end               = true
          + name                  = "allow dns from apps"
          + services              = [
              + "application-default",
            ]
          + source_addresses      = [
              + "10.0.0.0/8",
            ]
          + source_users          = [
              + "any",
            ]
          + source_zones          = [
              + "app",
            ]
          + type                  = "universal"
          + uuid                  = (known after apply)
          + virus                 = "av"
        }
    }

  # panos_panorama_static_route_ipv4.this["default"] will be created
  + resource "panos_panorama_static_route_ipv4" "this" {
      + destination    = "0.0.0.0/0"
      + id             = (known after apply)
      + metric         = 10
      + name           = "default"
      + next_hop       = "10.2.1.1"
      + route_table    = "unicast"
      + template       = "production TPL"
      + type           = "ip-address"
      + virtual_router = "vr"
    }

  # panos_panorama_static_route_ipv4.this["on-prem"] will be created
  + resource "panos_panorama_static_route_ipv4" "this" {
      + destination    = "192.168.0.0/16"
      + id             = (known after apply)
      + metric         = 10
      + name           = "on-prem"
      + next_hop       = "192.168.0.2"
      + route_table    = "unicast"
      + template       = "production TPL"
      + type           = "ip-address"
      + virtual_router = "vr"
    }

  # panos_panorama_template.this will be created
  + resource "panos_panorama_template" "this" {
      + default_vsys = (known after apply)
      + description  = "production template"
      + id           = (known after apply)
      + name         = "production TPL"
    }

  # panos_panorama_template_stack.this will be created
  + resource "panos_panorama_template_stack" "this" {
      + description = "production TPL STK"
      + devices     = (known after apply)
      + id          = (known after apply)
      + name        = "production TPL STK"
      + templates   = [
          + "production TPL",
        ]
    }

  # panos_panorama_virtual_router.this will be created
  + resource "panos_panorama_virtual_router" "this" {
      + ebgp_dist        = 20
      + ibgp_dist        = 200
      + id               = (known after apply)
      + interfaces       = (known after apply)
      + name             = "vr"
      + ospf_ext_dist    = 110
      + ospf_int_dist    = 30
      + ospfv3_ext_dist  = 110
      + ospfv3_int_dist  = 30
      + rip_dist         = 120
      + static_dist      = 15
      + static_ipv6_dist = 10
      + template         = "production TPL"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @migara, Action: `pull_request`*